frontend/controllers/MessageController.php

    protected function findModel($id)
    {
        if (($model = Message::findOne($id)) !== null) {
---
SELECT * FROM `message` WHERE `message_id`='12'