frontend/controllers/MessageHistoryController.php

    public function actionCreate($message_id, $sentlist_id, $delivery_id)
    {


        if( isset($message_id)
            && isset($sentlist_id)
            && isset($delivery_id)
            && !empty($message_id)
            && !empty($sentlist_id)
            && !empty($delivery_id)
            ){

                //echo $message_id;
                //echo $sentlist_id;
                //echo $delivery_id;

                $model = new MessageHistory();
                //$model->load(Yii::$app->request->post()){
                $model->message_id = $message_id;
                $model->message_sent_list = $sentlist_id;
                $model->delivery_id = $delivery_id;
                $model->save();
---
INSERT INTO `message_history` (`message_id`, `message_sent_list`, `delivery_id`) VALUES ('msg_5767fdd87b21f', 'sent_5767fea8da49a', 'msg_5767fa02de5ff')