frontend/controllers/MessageController.php

    public function actionCreate()
    {
        $session_group_id = Yii::$app->session;
        $session_group_id->open();
        $currently_selected_group_id = $session_group_id['grou_id'];
         $query = new Query;
            $query->select('group_name')
                  ->from('user_group')
                  ->where(['group_id' => $currently_selected_group_id]);
        $currently_selected_group_name = $query->one();
        //print_r($currently_selected_group_name['group_name']);

        $model = new Message();

        if ($model->load(Yii::$app->request->post())) {

            $model->message_author_id = Yii::$app->user->identity->id;
            $model->message_create_date = date('Y-m-d H:i:s');
            $model->message_subject = 'msg1';
            $model->message_sent_group = $currently_selected_group_name['group_name'];
            $model->save();
---
SELECT `group_name` FROM `user_group` WHERE `group_id`='22'
INSERT INTO `message` (`message_body`, `message_id`, `message_author_id`, `message_create_date`, `message_subject`, `message_sent_group`) VALUES ('Checking if a session variable exists in Vaadin', 'msg_5767fdd87b21f', 1, '2016-06-20 16:29:44', 'msg1', 'Home')

    protected function findModel($id)
    {

        /*
        * allows only the logged users to View, Update, delete the records
        */
        $query = new Query;
        $query  ->select('message_author_id')
                ->from('message')
                ->where(['message_id' => $id]);

        $logged_user_id = $query->one();
        //print_r($logged_user_id['message_author_id']);

        if (($model = Message::findOne($id)) !== null && Yii::$app->user->identity->id == $logged_user_id['message_author_id']) {
---
SELECT `message_author_id` FROM `message` WHERE `message_id`='75'
SELECT * FROM `message` WHERE `message_id`='75'