frontend/controllers/SentListController.php

    public function actionCreate()
    {
        if (Yii::$app->request->isAjax) {
            $data = Yii::$app->request->post();
            //print_r($data['keylist']['0']);
            //$recipient_id = $data['keylist']['0'];
            //echo $recipient_id;

            $recipient_id = implode(",",$data['keylist']);
            //echo $recipient_id;


            $model = new SentList();
            $model->recipient_phone_number = $recipient_id;
            $model->save();



            Yii::$app->runAction('message-history/create', ['message_id'=>'52','sentlist_id'=>'52', 'delivery_id'=>'1']);



        }

 /*       $model = new SentList();

        if ($model->load(Yii::$app->request->post())) {
            $model->recipient_phone_number = $data;
            $model->save();
---
SELECT 1 FROM `sent_list` WHERE `sent_list_id`='sent_5767fea8da49a'
INSERT INTO `sent_list` (`sent_list_id`, `recipient_phone_number`) VALUES ('sent_5767fea8da49a', '9,14')