frontend/controllers/UserGroupController.php

    protected function findModel($id)
    {
        if (($model = UserGroup::findOne($id)) !== null) {
---
SELECT * FROM `user_group` WHERE `group_id`='46'