frontend/models/RecipientListSearch.php

SELECT `group_id` FROM `user_group` WHERE `group_owner_id`=11
---
    public function search($params)
    {

        $current_logged_user_id = Yii::$app->user->identity->id; //get the id of the current user
        $group_id = $params['params'];

            $valid_groups_id_query = new Query;
            $valid_groups_id_query  ->select('group_id')
                                    ->from('user_group')
                                    ->where(['group_owner_id' => $current_logged_user_id]);

            $group_id_array = $valid_groups_id_query->all();